; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite2 - satellite
	instrument6 - instrument
	instrument7 - instrument
	satellite3 - satellite
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	instrument11 - instrument
	satellite5 - satellite
	instrument12 - instrument
	satellite6 - satellite
	instrument13 - instrument
	instrument14 - instrument
	instrument15 - instrument
	spectrograph4 - mode
	thermograph0 - mode
	infrared1 - mode
	spectrograph2 - mode
	image3 - mode
	Star1 - direction
	GroundStation6 - direction
	Star4 - direction
	GroundStation0 - direction
	Star5 - direction
	GroundStation2 - direction
	GroundStation3 - direction
	Planet7 - direction
	Phenomenon8 - direction
	Planet9 - direction
	Planet10 - direction
	Star11 - direction
)
(:init
	(supports instrument0 spectrograph4)
	(calibration_target instrument0 GroundStation3)
	(calibration_target instrument0 GroundStation6)
	(supports instrument1 spectrograph2)
	(supports instrument1 infrared1)
	(calibration_target instrument1 GroundStation2)
	(supports instrument2 spectrograph4)
	(supports instrument2 image3)
	(supports instrument2 thermograph0)
	(calibration_target instrument2 Star1)
	(calibration_target instrument2 GroundStation2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star1)
	(supports instrument3 image3)
	(calibration_target instrument3 GroundStation6)
	(supports instrument4 spectrograph2)
	(supports instrument4 thermograph0)
	(calibration_target instrument4 Star1)
	(calibration_target instrument4 GroundStation2)
	(supports instrument5 thermograph0)
	(supports instrument5 spectrograph2)
	(supports instrument5 spectrograph4)
	(calibration_target instrument5 GroundStation0)
	(calibration_target instrument5 Star4)
	(on_board instrument3 satellite1)
	(on_board instrument4 satellite1)
	(on_board instrument5 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Star1)
	(supports instrument6 infrared1)
	(supports instrument6 spectrograph2)
	(calibration_target instrument6 Star5)
	(supports instrument7 thermograph0)
	(supports instrument7 spectrograph4)
	(calibration_target instrument7 GroundStation2)
	(calibration_target instrument7 GroundStation6)
	(on_board instrument6 satellite2)
	(on_board instrument7 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star11)
	(supports instrument8 thermograph0)
	(calibration_target instrument8 GroundStation6)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 GroundStation0)
	(supports instrument9 thermograph0)
	(calibration_target instrument9 Star4)
	(supports instrument10 spectrograph4)
	(supports instrument10 image3)
	(calibration_target instrument10 Star4)
	(calibration_target instrument10 GroundStation2)
	(supports instrument11 image3)
	(calibration_target instrument11 GroundStation0)
	(calibration_target instrument11 Star5)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(on_board instrument11 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon8)
	(supports instrument12 infrared1)
	(supports instrument12 image3)
	(calibration_target instrument12 GroundStation2)
	(calibration_target instrument12 Star5)
	(on_board instrument12 satellite5)
	(power_avail satellite5)
	(pointing satellite5 GroundStation3)
	(supports instrument13 spectrograph4)
	(calibration_target instrument13 GroundStation3)
	(supports instrument14 image3)
	(supports instrument14 infrared1)
	(calibration_target instrument14 GroundStation2)
	(supports instrument15 infrared1)
	(calibration_target instrument15 GroundStation3)
	(on_board instrument13 satellite6)
	(on_board instrument14 satellite6)
	(on_board instrument15 satellite6)
	(power_avail satellite6)
	(pointing satellite6 Star1)
)
(:goal (and
	(pointing satellite0 Planet7)
	(pointing satellite3 Star11)
	(pointing satellite6 Planet7)
	(have_image Planet7 spectrograph2)
	(have_image Phenomenon8 image3)
	(have_image Planet9 image3)
	(have_image Planet10 infrared1)
	(have_image Star11 infrared1)
))

)

; plan
1. (turn_to satellite3 star11 groundstation0)
   deleted: (pointing satellite3 groundstation0)
   added: (pointing satellite3 star11)
   goals met: 1 of 8
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 1 of 8
3. (calibrate satellite0 instrument2 star1)
   added: (calibrated instrument2)
   goals met: 1 of 8
4. (turn_to satellite0 planet9 star1)
   deleted: (pointing satellite0 star1)
   added: (pointing satellite0 planet9)
   goals met: 1 of 8
5. (take_image satellite0 planet9 instrument2 image3)
   added: (have_image planet9 image3)
   goals met: 2 of 8
6. (turn_to satellite0 phenomenon8 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 phenomenon8)
   goals met: 2 of 8
7. (take_image satellite0 phenomenon8 instrument2 image3)
   added: (have_image phenomenon8 image3)
   goals met: 3 of 8
8. (turn_to satellite0 groundstation2 phenomenon8)
   deleted: (pointing satellite0 phenomenon8)
   added: (pointing satellite0 groundstation2)
   goals met: 3 of 8
9. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 3 of 8
10. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 3 of 8
11. (calibrate satellite0 instrument1 groundstation2)
   added: (calibrated instrument1)
   goals met: 3 of 8
12. (turn_to satellite0 planet10 groundstation2)
   deleted: (pointing satellite0 groundstation2)
   added: (pointing satellite0 planet10)
   goals met: 3 of 8
13. (take_image satellite0 planet10 instrument1 infrared1)
   added: (have_image planet10 infrared1)
   goals met: 4 of 8
14. (turn_to satellite0 star11 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 star11)
   goals met: 4 of 8
15. (take_image satellite0 star11 instrument1 infrared1)
   added: (have_image star11 infrared1)
   goals met: 5 of 8
16. (turn_to satellite0 planet7 star11)
   deleted: (pointing satellite0 star11)
   added: (pointing satellite0 planet7)
   goals met: 6 of 8
17. (take_image satellite0 planet7 instrument1 spectrograph2)
   added: (have_image planet7 spectrograph2)
   goals met: 7 of 8
18. (turn_to satellite6 planet7 star1)
   deleted: (pointing satellite6 star1)
   added: (pointing satellite6 planet7)
   goals met: 8 of 8
